title lab8 Kalinin

; Створити лінійний масив А, з парною кількістю елементів
; Створити масив В, елементи якого будуть сумою двох послідовних елементів

.model small
.stack 100h
include macros.mac

data segment
 	DATAS							; викликаємо макрос сегменту даних
data ends

code segment							; заносимо адресу сегменту даних у регістр DS
  	assume CS:code, DS:data					; а адресу початку сегменту коду до CS				
begin:								; точка входу в програму
	MOVING							; заносимо початок сегменту в регістр DS
	NEW_LINE						; виведення порожнього рядка
	PRINT_STR initStr					; виводимо речення, що позначає початковий масив	
	PRINT_ARR initArr, 10					; виводимо початковий масив
	FINAL_LENGTH initLength					; макрос знаходження довжини кінцевого масиву В
	FINAL_ARR						; макрос виконання заданого завдання (запис суми послідвоних чисел у новий масив)
	PRINT_STR finalStr					; виводимо речення, що позначає кінцевий масив
	PRINT_ARR finalArr, 5					; та сам кінцевий масив
	QUIT 							; макрос успішного завершення програми		
code ends

end begin
