#!/bin/bash

# Змінна для позначення групи студента
GROUP=12
# Змінна для обрахунку поточного рядку в текстовому файлі
COUNTER=1

# Команда запису інформації у файл. ключ -е дає змогу використовувати перехід на наступний рядок
echo -e "Labouratory work №5\nKalinin Yaroslav Olehovich\ngroup: TP-$GROUP\nstudent of the 2nd course">Kalinin.txt
# Команда. що виводить допоміжну інформацію у консоль
echo -e "\n-----Information inside the file-----"

# Цикл проходження по рядкам файлу, поки у файлі присутні рядки (змінна IFS - внутрішній роздільник полів) за допомогою команди read робимо..
while IFS= read -r line
do
	# Виводимо кожний рядок у термінал
	echo "$line"
	# Призупиняємо роботу програми на 2 секунди
	sleep 2
# Записуємо кінцевий результат у файл, який відкривали для читання по рядкам командою read
done < Kalinin.txt

# Копіювання файлу Kalinin.txt
$(cp Kalinin.txt Kalinin_copied.txt)

# Цикл проходження по рядкам файлу, поки у файлі присутні рядки, за допомогою читання з файл командою read, робимо..
while IFS= read -r line
do
	# Пошук рядка за заданим значенням за допомогою regex та команди grep, присвоюємо це значення змінній VALUE
	VALUE=$(grep -E '^group: TP-[0123456789][0123456789]' Kalinin_copied.txt)
	# Перевірка на відповідність, якщо рядок відповідає необхідному значенню VALUE (рядку з групою) - видаляємо його
	if [ "$line" = "$VALUE" ]; then
		# Виведення допоміжного речення що вказує на початко виконання операції видалення рядку 
		echo -e "\ndeleting line: "$line"..."
		# Призупиняємо роботу програми на 0.8 секунд
        sleep 0.8
        # Безпосередньо команда видалення рядка за його номером (що відповідає значенню counter) у файлі
		sed -i "$COUNTER d" Kalinin_copied.txt
	fi
	# Збільшуємо значення лічильника на 1 після проходження кожного рядка файлу
	COUNTER=$((COUNTER+1))
# Завершуємо роботу циклу "while", записуємо отримані значення у файл
done < Kalinin_copied.txt

# Вивід допоміжної інформації у консоль
echo -e "\n-----Information inside the eventual file-----"
# Виведення наповнення кінцевого файлу у консоль
cat Kalinin_copied.txt
# Успішне завершення роботи скрипту
exit 0